//Please support the only one on Steam (release: 2022/1/21) 
#include<bits/stdc++.h>
#include<stdio.h>
#include<conio.h>
#include<windows.h>
using namespace std;
string scr[35][42];
int wo[2]={1,1},fc,plc;//wo[1]行 wo[0]列;fc, 0 left, 1 up, 2 right, 3 down
char in;
bool doSave,fast;
int keys[8]={5163, 2333, 0174, 1401, 9541, 7905, 0221, 5148};
COORD co;
HANDLE hStdOut;

void typout(string s);
void prtscr(short x, short y, string str, bool tempFast=false){
	scr[x][y+1]=str;
	co.X=y*2-2;
	co.Y=x-1;
	SetConsoleCursorPosition(hStdOut, co);
	if(str.size()!=2){
		for(int i=0;i<str.size();i+=2){
			scr[x][y+1+i/2]=str.substr(i,2);
		}
	}
	if(fast==true) tempFast=false;
	if(tempFast) fast=true;
	typout(str);
	if(tempFast) fast=false;
	if(str.substr(str.size()-2, 2)=="▼"){
		in=getch();
		scr[x][y+str.size()/2]="  ";
		co.X+=str.size()-2;
		SetConsoleCursorPosition(hStdOut, co);
		cout<<"  ";
	}
}
void save(){
	if(doSave) return;
	plc++;
	freopen("D:\\文字游戲\\data.log","w+",stderr);
	clog<<keys[plc];
	freopen("D:\\twzyxdata\\data.log","w+",stderr);
	clog<<keys[plc];
	fclose(stderr);
	cout<<"						√进度已保存。"; 
}
void clscr(){
	for(int i=1;i<35;i++)
	 	for(int j=1;j<42;j++) scr[i][j]="  ";
	return;
}
void typout(string s){
	for(int i=0;i<s.size();i++){
		cout<<s[i];
		if(!fast) Sleep(40);
		if(i>1){
			if(!fast && s.substr(i-2, 2)=="，") Sleep(360);
			else if(!fast && s.substr(i-1, 2)=="。") Sleep(460);
		}
		if(kbhit()){
			in=getch();
			if(in==' '){
				for(int j=i+1;j<s.size();j++){
					cout<<s[j];
				}
				return;
			}
		} 
	}
	return;
}

void startMenu(){
	int choice=0; 
	if(!plc) cout<<endl<<endl<<endl<<endl<<endl<<endl<<"        這是一段關於  的故事"<<endl<<endl<<"我開始冒險                調整設定";
	else cout<<endl<<endl<<endl<<endl<<endl<<endl<<"        這是一段關於  的故事"<<endl<<endl<<"我開始冒險    繼續冒險    調整設定";
	while(1){
		in=getch();
		system("cls");
		if(in=='a'){
			if(choice>0){
				choice--;
				if(choice==1&&!plc) choice--;
			}
		}
		else if(in=='d'){
			if(choice<2){
				choice++;
				if(choice==1&&!plc) choice++;
			}
		}
		else if(in==' '){
			if(choice==0){
				plc=0;
				return;
			}
			else if(choice==1) return;
			else{
				choice=0;
				while(1){
					cout<<endl<<endl<<endl<<endl;
					if(choice==0) cout<<"我";
					else cout<<"  ";
					if(doSave) cout<<"打開自動存檔。"<<endl;
					else cout<<"關閉自動存檔。"<<endl;
					if(choice==1) cout<<"我";
					else cout<<"  ";
					if(fast) cout<<"關閉快速游戲。"<<endl;
					else cout<<"打開快速游戲。"<<endl;
					if(choice==2) cout<<"我";
					else cout<<"  ";
					cout<<"重新開始。"<<endl;
					if(choice==3) cout<<"我";
					else cout<<"  ";
					cout<<"返回開始頁面。"; 
					in=getch(); 
					system("cls");
					if(in=='w'&&choice!=0) choice--;
					else if(in=='s'&&choice!=3) choice++;
					else if(in==' ')
						switch(choice){
							case 0:
								doSave=!doSave;
								break;
							case 1:
								fast=!fast;
								break;
							case 2:
								freopen("%Appdata%\\文字游戲\\data.log","w",stderr);
								clog<<0;
								freopen("%Appdata%\\twzyxdata\\data.txt","w",stderr);
								clog<<0;
								fclose(stderr);
								plc=0;
								break;
							case 3:
								choice=2;
								goto mainMenu;
						} 
					
				}
			}
		}
		mainMenu:;
		cout<<endl<<endl<<endl<<endl<<endl<<endl<<"        這是一段關於  的故事"<<endl<<endl;
		if(choice==0) cout<<"我";
		else cout<<"  ";
		cout<<"開始冒險  ";
		if(choice==1&&plc) cout<<"我";
		else cout<<"  ";
		if(plc) cout<<"繼續冒險  ";
		else cout<<"          ";
		if(choice==2) cout<<"我";
		else cout<<"  ";
		cout<<"調整設定";
	} 
}
void veryStart(){
	cout<<endl<<endl<<endl<<endl; 
	typout("  我睜開眼睛。天亮了，外頭傳來鳥兒啾啾叫的聲音。▼");
	in=getch();
	system("cls");
	cout<<endl<<endl<<endl<<endl; 
	typout("  這是我的房間。▼");
	in=getch();
	system("cls");
	cout<<endl<<endl<<endl<<endl<<"  這是我的房間。"<<endl;
	typout("  有一張床，床邊有一盞燈，燈下有一個茶杯。▼");
	in=getch(); 
	system("cls");
	cout<<endl<<endl<<endl<<endl<<"  這是我的房間。"<<endl;
	typout("  牆上有一幅畫，旁邊挂著外出用的大衣。▼");
	in=getch(); 
	system("cls");
	cout<<endl<<endl<<endl<<endl; 
	typout("  今天是我正式成爲勇者的日子，沒時間蹉跎了。▼");
	in=getch(); 
	system("cls");
	cout<<endl<<endl<<endl<<endl; 
	prtscr(5, 2,"「趕快開門出去吧……」▼");
	prtscr(7, 2, "我在心裏對著自己説，並舉步向前。▼"); 
	wo[1]=7; wo[0]=3;
	scr[wo[1]][wo[0]]="  ";
	while(1){
		in=getch();
		if(wo[0]-2&&in=='a'&&scr[wo[1]][wo[0]-1]=="  "){
			wo[0]--;
		}else if(wo[1]-2&&in=='w'&&scr[wo[1]-1][wo[0]]=="  "){
			wo[1]--; 
		}else if(wo[0]<20&&in=='d'&&scr[wo[1]][wo[0]+1]=="  "){
			wo[0]++;
		}else if(wo[1]<10&&in=='s'&&scr[wo[1]+1][wo[0]]=="  "){
			wo[1]++; 
		}else if(in=='s'&&wo[1]==4&&wo[0]==7){
			Sleep(500); 
			system("cls");
			cout<<endl<<endl<<endl<<"          我"<<endl<<"  「趕快開||出去吧……」"<<endl<<endl<<"    在心裏對著自己説，並舉步向前。";
			Sleep(700);
			system("cls");
			cout<<endl<<endl<<endl<<endl<<"  「趕快開我出去吧……」"<<endl<<endl<<"    在心裏對著自己説，並舉步向前。";
			Sleep(550);
			system("cls");	
			break;
		}else if(in=='w'&&wo[1]==6&&wo[0]==7){
			Sleep(500); 
			system("cls");
			cout<<endl<<endl<<endl<<endl<<"  「趕快開||出去吧……」"<<endl<<"          我"<<endl<<"    在心裏對著自己説，並舉步向前。";
			Sleep(700);
			system("cls");
			cout<<endl<<endl<<endl<<endl<<"  「趕快開我出去吧……」"<<endl<<endl<<"    在心裏對著自己説，並舉步向前。";
			Sleep(550);
			system("cls");	
			break;
		}
		if(in=='a'){
			fc=0;
		}else if(in=='w'){
			fc=1;
		}else if(in=='d'){
			fc=2;
		}else if(in=='s'){
			fc=3;
		}
		scr[wo[1]][wo[0]]="我";
		system("cls"); 
		for(int i=1;i<11;i++){
			for(int j=2;j<21;j++)cout<<scr[i][j];
			cout<<endl;
		}
		scr[wo[1]][wo[0]]="  ";
		Sleep(50);
	} 
	save();
	return; 
} 
void theCorridor(){
	clscr();
	prtscr(6, 1, "房門外是一條長廊，");
	scr[6][3]="間";
	prtscr(11,1, "這裏沒有什麽東西，▼");
	system("cls"); 
	cout<<endl<<endl<<endl<<endl<<endl<<"房||外是一條長廊，"<<endl\
		<<endl<<endl<<endl<<endl<<"這裏沒有什麽東西，";
	Sleep(500);
	system("cls"); 
	cout<<endl<<endl<<endl<<endl<<endl<<"房我外是一條長廊，"<<endl\
		<<endl<<endl<<endl<<endl<<"這裏沒有什麽東西，";
	Sleep(500);
	system("cls"); 
	cout<<endl<<endl<<endl<<endl<<endl<<"房  外是一條長廊，"<<endl\
		<<"  我"<<endl<<endl<<endl<<endl<<"這裏沒有什麽東西，";
	Sleep(500);
	system("cls"); 
	cout<<endl<<endl<<endl<<endl<<endl<<"房||外是一條長廊，"<<endl\
		<<"  我"<<endl<<endl<<endl<<endl<<"這裏沒有什麽東西，";
	Sleep(500);
	system("cls"); 
	cout<<endl<<endl<<endl<<endl<<endl<<"房門外是一條長廊，"<<endl\
		<<"  我"<<endl<<endl<<endl<<endl<<"這裏沒有什麽東西，";
	Sleep(500);
	system("cls"); 
	cout<<endl<<endl<<endl<<endl<<endl<<"房間外是一條長廊，"<<endl\
		<<"  我"<<endl<<endl<<endl<<endl<<"這裏沒有什麽東西，";
	Sleep(500);
	wo[1]=7; wo[0]=3;
	while(wo[0]<10){
		in=getch();
		prtscr(wo[1],wo[0]-1,"  ",true);
		if(wo[0]-2&&in=='a'&&scr[wo[1]][wo[0]-1]=="  "){
			wo[0]--;
		}else if(wo[1]-2&&in=='w'&&scr[wo[1]-1][wo[0]]=="  "){
			wo[1]--; 
		}else if(in=='d'&&scr[wo[1]][wo[0]+1]=="  "){
			wo[0]++;
		}else if(in=='s'&&scr[wo[1]+1][wo[0]]=="  "){
			wo[1]++; 
		}
		if(in=='a') fc=0;
		else if(in=='w') fc=1;
		else if(in=='d') fc=2;
		else if(in=='s') fc=3;
		prtscr(wo[1],wo[0]-1,"我",true);
		Sleep(50);
	}
	prtscr(6, 10, "黑漆漆的。");
	prtscr(11,10, "空蕩蕩的。▼");
	scr[wo[1]][wo[0]]="  ";
	while(wo[0]<15){
		in=getch();
		prtscr(wo[1],wo[0]-1,"  ",true);
		if(wo[0]-2&&in=='a'&&scr[wo[1]][wo[0]-1]=="  "){
			wo[0]--;
		}else if(wo[1]-2&&in=='w'&&scr[wo[1]-1][wo[0]]=="  "){
			wo[1]--; 
		}else if(in=='d'&&scr[wo[1]][wo[0]+1]=="  "){
			wo[0]++;
		}else if(in=='s'&&scr[wo[1]+1][wo[0]]=="  "){
			wo[1]++; 
		}
		if(in=='a')      fc=0;
		else if(in=='w') fc=1;
		else if(in=='d') fc=2;
		else if(in=='s') fc=3;
		prtscr(wo[1],wo[0]-1,"我",true);
		Sleep(50);
	}
	scr[wo[1]][wo[0]]="我";
	prtscr(6, 15, "不遠處的長廊盡頭隱約可見火光閃動。");
	prtscr(11,15, "除了一步一步向前邁進沒有其他辦法。▼"); 
	scr[wo[1]][wo[0]]="  ";
	while(wo[0]<32){
		in=getch();
		prtscr(wo[1],wo[0]-1,"  ",true);
		if(wo[0]-2&&in=='a'&&scr[wo[1]][wo[0]-1]=="  "){
			wo[0]--;
		}else if(wo[1]-2&&in=='w'&&scr[wo[1]-1][wo[0]]=="  "){
			wo[1]--; 
		}else if(in=='d'&&scr[wo[1]][wo[0]+1]=="  "){
			wo[0]++;
		}else if(in=='s'&&scr[wo[1]+1][wo[0]]=="  "){
			wo[1]++; 
		}
		if(in=='a')      fc=0;
		else if(in=='w') fc=1;
		else if(in=='d') fc=2;
		else if(in=='s') fc=3;
		prtscr(wo[1],wo[0]-1,"我",true);
		Sleep(50);
	}
	scr[wo[1]][wo[0]]=="我"; 
	prtscr(1, 32, "前");
	prtscr(2, 32, "進");
	prtscr(3, 32, "的");
	prtscr(4, 32, "不");
	prtscr(5, 32, "二");
	prtscr(6, 32, "法");
	prtscr(7, 32, "門");
	prtscr(8, 32, "，");
	Sleep(360);
	prtscr(9, 32, "肯");
	prtscr(10,32, "定");
	prtscr(11,32, "是");
	prtscr(12,32, "大");
	prtscr(13,32, "步");
	prtscr(14,32, "跨");
	prtscr(15,32, "越");
	prtscr(16,32, "。");
	prtscr(17,32, "▼");
	scr[wo[1]][wo[0]]="  ";
	while(1){
		in=getch();
		prtscr(wo[1],wo[0]-1,"  ",true);
		if(wo[0]-2&&in=='a'&&scr[wo[1]][wo[0]-1]=="  "){
			wo[0]--;
		}else if(wo[1]-2&&in=='w'&&scr[wo[1]-1][wo[0]]=="  "){
			wo[1]--; 
		}else if(in=='d'&&scr[wo[1]][wo[0]+1]=="  "){
			wo[0]++;
		}else if(in=='s'&&scr[wo[1]+1][wo[0]]=="  "){
			wo[1]++; 
		}else if(in=='d'&&scr[wo[1]][wo[0]+1]=="門"){
			prtscr(wo[1],wo[0]-1,"我",true); 
			cout<<"||";
			Sleep(700);
			prtscr(wo[1],wo[0]-1,"  我",true);
			Sleep(550);
			prtscr(wo[1],wo[0],"  ",true);
			Sleep(100);
			goto after;
		}
		if(in=='a')      fc=0;
		else if(in=='w') fc=1;
		else if(in=='d') fc=2;
		else if(in=='s') fc=3;
		prtscr(wo[1],wo[0]-1,"我",true);
		Sleep(50);
	}
	after:	system("cls");
	save();
	return; 
} 

void houseCheckObject(string str){
	if(str!="  "){
		prtscr(10,5, "                                    ", true);
		prtscr(11,5, "                                      ", true);
		prtscr(12,5, "                                      ", true);
	} 
	if(str=="牆"){
		prtscr(10, 5, "只是一面朴实无华的磚牆");
	}else if(str=="爐"){
		prtscr(10,5, "歐非士王國製造的壁爐，非常耐用。");
		prtscr(11,5, "好像有重要的事，去桌上看一看好了。▼");
	}else if(str=="紙"){
		prtscr(15,27,"桌", true);
		prtscr(10,5, "紙上模模糊糊的有些字，但看不清了。");
		prtscr(11,5, "下面還寫著行小字：作者能力有限，寫不出這個功能。▼");
		prtscr(10,5, "                                  ", true);
		prtscr(11,5, "                                                ", true);
		prtscr(10,5, "不知道是什麽意思，先不管它了。▼");
	}else if(str=="椅"){
		prtscr(10,5, "不知道是誰從賓格王國帶回來的紀念品，");
		prtscr(11,5, "坐起來很舒服，但是不能坐太久。");
		prtscr(12,5, "桌上的行事日曆提醒著：準時前往集會所。▼");
	}else if(str=="桌"){
		prtscr(10,5, "工作時常用的寫字桌。");
		prtscr(11,5, "抽屜裏，整齊排列著五花八門的文書工具。");
		prtscr(12,5, "可惜接下來大概有一段時間不會坐到桌前。▼");
	}else if(str=="鐘"){
		prtscr(10,5, "鐘面上印著溫鐸斯王國的標記，");
		prtscr(11,5, "那是曆法誕生之處，總有一天要去拜訪。");
		prtscr(12,5, "這個心願，一直好好地收藏在抽屜裏。▼");
	}
	return;
}
void theHouse(){
	clscr();
	for(int i=1;i<33;i++){
		prtscr(1, i, "牆", true);
		prtscr(18, i,"牆", true);
	}
	for(int i=2;i<18;i++){
		prtscr(i, 1, "牆", true);
		prtscr(i, 32,"牆", true); 
	}
	prtscr(2, 7, "爐", true);
	prtscr(2, 26,"鐘", true);
	prtscr(12,28,"椅", true);
	prtscr(14,27,"桌桌桌", true);
	prtscr(15,27,"紙桌桌", true);
	Sleep(500);
	prtscr(7, 5, "我推開門，這裏是我家的起居室。");
	prtscr(8, 5, "房間的四面牆壁都是用厚實的紅磚所砌成。▼");
	prtscr(7, 5, "                              ", true);
	prtscr(8, 5, "                                        ", true);
	prtscr(7, 5, "左手邊有座火爐，右手邊則掛著一個咕咕鐘");
	prtscr(8, 5, "身側還擺了一副桌椅。▼");
	prtscr(7, 5, "                                      ",true);
	prtscr(8, 5, "                      ",true);
	prtscr(7, 5, "房間的四面牆壁是用厚實的紅磚所砌成。");
	prtscr(8, 5, "奇怪的是，四周連一扇門都沒有。▼");
	prtscr(7, 5, "                                    ",true);
	prtscr(8, 5, "                                ",true);
	prtscr(7, 5, "我想起調查的方法，對著東西按下空白鍵就可以");
	prtscr(8, 5, "瞭解更多。離開房間的出口，或許就藏在其中。▼");
	scr[7][6]="  ";
	wo[1]=7; wo[0]=6;
	while(1){
		in=getch();
		if(in==' '){
			if(fc==0)
				houseCheckObject(scr[wo[1]][wo[0]-1]); 
			else if(fc==1)
				houseCheckObject(scr[wo[1]-1][wo[0]]);
			else if(fc==2)
				houseCheckObject(scr[wo[1]][wo[0]+1]);
			else houseCheckObject(scr[wo[1]+1][wo[0]]);
		}
		if(in=='s'&&scr[wo[1]+1][wo[0]]=="門"){
			prtscr(11,17,"||",true);
			Sleep(700);
			prtscr(10,17,"  ",true);
			prtscr(11,17,"我",true);
			Sleep(550);
			prtscr(11,17,"  ",true);
			Sleep(100);
			goto outside;
		}
		prtscr(wo[1],wo[0]-1,"  ",true); 
		if(in=='a'&&scr[wo[1]][wo[0]-1]=="  "){
			wo[0]--;
		}else if(in=='w'&&scr[wo[1]-1][wo[0]]=="  "){
			wo[1]--; 
		}else if(in=='d'&&scr[wo[1]][wo[0]+1]=="  "){
			wo[0]++;
		}else if(in=='s'&&scr[wo[1]+1][wo[0]]=="  "){
			wo[1]++; 
		}
		if(in=='a'){
			fc=0;
		}else if(in=='w'){
			fc=1;
		}else if(in=='d'){
			fc=2;
		}else if(in=='s'){
			fc=3;
		}
		prtscr(wo[1],wo[0]-1,"我",true);
		Sleep(50);
	}
	outside:;
	system("cls");
	save();
	return;
}

void mainStreet(){
	cout<<endl<<endl;
	typout("Oops，作者還沒有寫到這裏！\n");
	typout("後面的内容，可能要很久才能複刻出來了。。\n");
	typout("畢竟作者還在上學呢（");
	in=getch();
}

int main(){	
	cout.tie(0);
	hStdOut = GetStdHandle(STD_OUTPUT_HANDLE);
	CONSOLE_CURSOR_INFO cci, cciOld;
	GetConsoleCursorInfo(hStdOut, &cciOld);
	cci.bVisible = FALSE;    /* 不可见 */
	cci.dwSize = 100;        /* 块状 */
	SetConsoleCursorInfo(hStdOut, &cci);
	
	for(int i=1;i<35;i++)
	 	for(int j=1;j<42;j++) scr[i][j]="  ";
	
	system("title 文字游戲：第零章");
	system("mode con cols=230 lines=55");
	system("color 70");
	cout<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@@@@@@@@@0@@0@0@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00000000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0000000088880000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00088808000@@@@0@@@@@@@0@@@@@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00@@@@0@000888888CfttttfC80@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl\
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@008CLLffLGC800000@@@@@00000000000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@@@@@@0000888CCLLfffftt      L800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000      ;tfLG8800000@@08CLLLGC880000@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@0@@000000000@@@08CGLftt1            GC800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000CL        :tfGGC80008C1    ttLGC800000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00008CCGGGC800@@0CL                C8000000000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@08C            ,tLGC8CC1        tfGC800@@@@@@@@@@@@@@0@@@@000@@@@@@0@0@@@@@@@@@@@@@@@@@@@@@@@@0@@@@@@@@@@@@@@@@@@@@@@0008CCLt;    C80@00CL          0C8000000000000000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000GL              ,tLLLf;          C800@@@@@@@@@@@@@@@00000000000000@@@@@@@@@0000000000@@0000000000000000000000@@@@@@08C;        880@@088      08000000@@0088.   f80@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@08C                  .1:          GC8000@0@0@@@0@@@@00080CGGGLGC8800@0@@@@@@08CCCG8800@000C8GGGGCC8888CGGGC880@@@@@008G;     .LC000@@00000000000080000          t800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000GL                             tfGCC8000000000@@@0008        ;G800@@@@@0@8Cf    C80@008C      LCGG      1C80@@@0008C;     .8800@@@@@@@@@@0800C8            iGC00@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@088                                 fLGGGGC8C880000008Gf.     ,LC80@@@@@@08Ct    G80@@0CL      fLGf      iC8000@0@00@1      @0@@0@0@@@@00088                t80@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00CG,                                      tfLGGGGGGGft.       :G800000008Ct    GC0008CL      1f        iG8@0000@0i ;0000000000008000000CGL              tG80@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@00088CCCCGL;                                                  ,fLGGGGGGC8Gf    88088GLt      i1            f00@@@@0000@00808CL  CGC888CG              LC8000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00088CCGL;                                                       GCC888088G                    f888000000000@008Ct          CGGL        fLGC8880000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@08t        ffLt                                           G80@@@@0CL                88000@00@@000000008Ci            GLLt        GC800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000CLi      GCCC      fLGCCGGf                             GC0000008C          0800000000@008,     i8008G;          1tft        itLGC8800@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@008C1      fG8CGf    LC0@@0CC    1LLL               1:    GGC88800008@  @8800000000088CG,       :tfGGGLf;                            L80@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000Ct        CCGL    fGC00088    f880CG.           .fi    GL      000@00@000@008C8                             ff1i                  L800@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00CL1      ffft      G800008CCC8000008CCGLf,     .GGCCC88C  0800000000000@                                 LLGf                  tGC00@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@088L                C800@0088CGGGGGGGGGGLf:     .C8@0@00@@0000000888888CC      i1          .;.            ffLt                  G80@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@008CCCGf1      tLG8800@@008                  :8800000@00@@@000      GLGL      ;1                             ti        fLGCCCC8800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00008CGft      tLGC800@@008GL            i80000000@0000000008G        ff                                     f1        CC0@0@000@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@08L              LG800@00088CCGGCCC800000000088f    GGGGGGLf        i1        ;1ii    :i.                fff1      1tLGC88000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00008Cf      ffft      G8000@00000000000000088C1                Lfft        1t            ;t,       .1:      ft              880@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@0@0008CCGL1i    CCCG        @00@@@@@@@@@@000i                      CCGL      1tfL            ;t.     ,ttt:    fLGt            fG800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0008CCCGL1        LG80888CCCC880000000000000@@000008CCGf;    fLGGGGGGG888CG    tt    fft1    iLff.   ,ttt:        CGL1            G80@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@008i              880@0@0000000000888CCCCC800@@@0@008CGf;    GC00000008CGGL  fttt    it    ifGCCG.   ,1,     .fLCCCt            LG800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00CG1          88800@0@@@@@@@0@          1G800@@@8C;        G800@@008G    ff                iGLG.           .fLGGLi      tfGGCC80000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0008CCf    88000000@00000@@@@@000CL        1C0@@08C;       .C80@@@00CG    LL                  1L.                        fLG8880@@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00@000000@00000880    0000@@@000CC        1C00000888CGGGCC0800@@@@0088CC8CC8CGGGGGGGGGGGGGGC8888CCGLf,            ft11      880@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@000008CC        880@@@@@00088CGGGGCC8000@@0000000000000@@@@@000000000000000000000000000000000088CCGLL;    LGGf        C80@@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@008G      GGC88000@@@@@@0000000000000@@@@@00@@00@@@@@@@@@@@@@@@@@@@@00@@@@@@@@@@@@@@@@@@@0@@00000088CCC888Cf      LC800@@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00C8L  CCC80000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0000000008CGf  GCC800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00@00088888800@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00088888800@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0000000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0000000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@0@@@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@00000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@@@@0@@@00@@@@@@@@@0@0@@@@@00@@0@@0@0@0@00@@0@@@@@0@@G   @@@@@@@@@@@@@@@@@@@0@@00@@@@@0@@0@@@@@@@0@@@@@0@@@0@0@@@0@@@@@00@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00@@000@@@0@@@0@0@0@@0@0@@@@@@0@@@@@0@@@@@@@@0@@@@@@000C   @@@@@@@@@@@@@@@@@@@@@@@0@@@@@@0@@@@@@@0@@@@@@@00@@000@0@@@@@@@@00@@@@@0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@   L00L   @@@      :@000@0   L@@L   0@000@:      @@@@@@@@@@@@@0@0@@@:  :0@00@@@@0:      0@000@:  ,@@@   @@@0@0L         @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@   @@@   L00L   @@@   L00f   @0@      :0000@0   L00L   @@@@@@@@@@@@@@@0   L00f   @00   f00L   0@0   L00L   000   L0@L      00000@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00@0   0@@   L@0L   @@@   G@@G   @@@      :@@@@@@   L0@G   @@@@@@@@@@@@@00@   G00L   0@@   L@0L   0@@   L0@G   0@0   L@@L      @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@0@@0   0@@:  :@0@@@@          @@@   L0@0@@@@@@          @@@@@@@@@@@@@00@          0@@          0@@   L00G   0@0   L@@L         0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@00   00@:  :@0@0@0          000   L@@@@@@@@@          @@@@@@@@@@@@@0@0          @00          @@@   L@0G   0@@   G@0G         00@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@@00@@00@@@@0@@@@@@@@@0@0@0@@@@@@@@@@@00@@@@@@00@@@@@@@@@@@@@@00@00000L   @@0@@@@@@@@@00@@0000@@000@@@00@@@@00@@0@@@@@@00@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@      ,@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@0@      ,0@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl
<<"@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@"<<endl;
	in=getch();
	system("color 0F");
	in='0';
	system("cls");
	//The main part starts here
	system("mkdir D:\\文字游戲");
	system("mkdir D:\\twzyxdata");
	system("attrib +s +h D:\\twzyxdata");
	freopen("D:\\文字游戲\\data.log","r",stderr);
	fclose(stderr);
	freopen("D:\\twzyxdata\\data.log","r",stderr);
	fclose(stderr);
	ifstream file;
	system("cls");
	file.open("D:\\twzyxdata\\data.log",ios::in);
	if(file.eof()!=true){
		int cmp=0;
		file>>plc;
		file.close();
		file.open("D:\\文字游戲\\data.log",ios::in);
		file>>cmp;
		if(cmp!=plc){
			system("color 04");
			system("echo.");
			system("echo.");
			system("echo 你不會想通過修改本地文件跳關吧。。");
			system("echo 游戲並不難，何必這樣呢？"); 
			system("echo 我都“加密”了關卡代碼了，怎麽會允許跳關呢！");
			system("echo.");
			Sleep(10e8);
			return 0;
		}
	}
	file.close();
	for(int i=0;i<8;i++)
		if(keys[i]==plc){
			plc=i;
			break;
		}
	startMenu();
	if(plc<1) veryStart();
	if(plc<2) theCorridor();
	if(plc<3) theHouse();
	if(plc<4) mainStreet(); 
	
	freopen("D:\\文字游戲\\data.log","w+",stderr);
	clog<<0;
	freopen("D:\\twzyxdata\\data.log","w+",stderr);
	clog<<0;
	fclose(stderr);
	system("echo.");
	system("echo 游戏已结束，进度已重置。");
	system("echo 文字游戏原版：https://store.steampowered.com/app/1109570/_/"); 
	return 0;
}
